benchmarks/jmx/inference_mms_local_monitoring.yaml
---
execution:
- concurrency: 1
  ramp-up: 5s
  hold-for: 1m
  scenario: Inference
scenarios:
  Inference:
    default-address: ${__P(protocol,https)}://${__P(hostname,127.0.0.1)}:${__P(port,8443)}/
    requests:
    - follow-redirects: true
      label: Inference Request
      method: POST
      upload-files:
      - mime-type: image/jpeg
        param: data
        path: ${__P(input_filepath)}
      url: ${__P(protocol,http)}://${__P(hostname,127.0.0.1)}:${__P(port,8080)}/predictions/${model}
    store-cache: false
    store-cookie: false
    use-dns-cache-mgr: false
    variables:
      model: ${__P(model_name,squeezenet_v1.1)}

modules:
  jmeter:
    properties:
      input_filepath : kitten.jpg
      model_name : squeezenet
  mms_monitoring:
    class : mms_monitoring.Monitor

#services:
#  - module: monitoring
#    server-agent:
#      - address: localhost:9009
#        label: mms-inference-server  # if you specify label, it will be used in reports instead of ip:port
#        interval: 1s    # polling interval
#        logging: True # those logs will be saved to "SAlogs_192.168.0.1_4444.csv" in the artifacts dir
#        metrics:
#          - sum_cpu_percent
#          - sum_mem_percent
#          - sum_num_handles
#
#reporting:
#- module: passfail
#  criteria:
#  - class: bzt.modules.monitoring.MonitoringCriteria
#    subject: mms-inference-server/sum_mem_percent
#    condition: '>'
#    threshold: 4
#    timeframe: 5s
#    fail: true
#    stop: true


services:
  - module: mms_monitoring
    MMS_local:
    - interval: 1s
      metrics:
      - cpu
      - disk-space
      - mem
reporting:
- module: passfail
  criteria:
  - class: bzt.modules.monitoring.MonitoringCriteria
    subject: MMS_local/cpu
    condition: '>'
    threshold: 30
    timeframe: 1s